// src/utils/unitsMap.ts
export const globalUnits: Record<string, string> = {
  // HVO 1
  'Температура в емкости E2/1 север': '°C',
  'Температура в емкости E2/1 юг': '°C',
  'Температура в емкости E2/2 север': '°C',
  'Температура в емкости E2/2 юг': '°C',

  'Давление воды на карбон': 'бар',
  'Давление воды на к265': 'бар',
  'Давление воды на к312': 'бар',
  'Давление воды после насоса H4/1': 'бар',
  'Давление воды после Ф4/1,2,3': 'бар',
  'Давление воды после насоса H4/2': 'бар',
  'Давление воды после насоса H5/1': 'бар',
  'Давление воды после насоса H5/2': 'бар',
  'Давление воды после насоса H6/1': 'бар',
  'Давление воды после насоса H6/2': 'бар',
  'Давление воды после насоса H6/3': 'бар',

  'Расход умягченной воды после Ф4/1,2,3': 'м³/ч',
  'Расход воды в канализацию': 'м³/ч',

  'Уровень воды в E2/1 (Титан)': 'мм',
  'Уровень воды в E2/1 (Мида)': 'мм',
  'Уровень воды в E2/2 (Титан)': 'мм',
  'Уровень воды в E2/2 (Мида)': 'мм',

  'Рабочая частота насоса H4/1': '%',
  'Рабочая частота насоса H4/2': '%',
  'Рабочая частота насоса H5/1': '%',
  'Рабочая частота насоса H5/2': '%',
  'Рабочая частота насоса H6/1': '%',
  'Рабочая частота насоса H6/2': '%',
  'Рабочая частота насоса H6/3': '%',

  'Контроль положения ИМ2': '',
  'УПД №1 (Шкаф №2)': '',
  'УПД №2 (Шкаф №2)': '',
  'Измерение уровня воды на регулятор уровня': 'мм',

  'Давление воды на входе установки': 'бар',
  'Давление воды после насосов H1/1,2,3': 'бар',
  'Давление воды после насосов H2/1,2': 'бар',
  'Давление воды после насосов H3/1,2': 'бар',

  // flows
  'Расход воды на установку': 'м³/ч',
  'Расход воды на промывку фильтров': 'м³/ч',

  // levels
  'Уровень воды в емкости E1/1': 'мм',
  'Уровень воды в емкости E1/2': 'мм',
  'Уровень воды в емкости E2/1,2': 'мм',

  // frequency
  'Выход РАН давления воды для ПЧ H1/1': '%',
  'Рабочая частота насоса H1/1': '%',
  'Выход РАН давления воды для ПЧ H1/2': '%',
  'Рабочая частота насоса H1/2': '%',
  'Выход РАН давления воды для ПЧ H2/1': '%',
  'Рабочая частота насоса H2/1': '%',
  'Выход РАН давления воды для ПЧ H2/2': '%',
  'Рабочая частота насоса H2/2': '%',

  // task
  'Задание уровня воды в емкостях E1/1,2': '%',
  'Задание рег-ру давления воды после H1/1,2': 'бар',
  'Задание рег-ру давления воды после H2/1,2': 'бар',

  // others
  'Контроль положения ИМ1': '',
  'УПД №1 (Шкаф №1)': '',
  'УПД №2 (Шкаф №1)': '',
};
